[
    {
        "product_id": "C002",
        "complaint": "คุชชั่นเป็นคราบง่าย",
        "detail": "คุชชั่นบางเบา แต่ทาแล้วเป็นคราบเร็ว ประมาณ 3 ชั่วโมงหลังทาเริ่มเป็นคราบ"
    },
    {
        "product_id": "C002",
        "complaint": "หน้าแห้งเกินไป",
        "detail": "เนื้อคุชชั่นแบบ semi-matte แต่ทำให้หน้าแห้งมาก เกินความคาดหวัง แม้ไม่ได้ใช้ครีมหนักหรือกันแดด"
    },
    {
        "product_id": "C002",
        "complaint": "เนื้อคุชชั่นเลอะตอนแกะ",
        "detail": "ตอนแกะคุชชั่นเนื้อเลอะเล็กน้อย และพัฟไม่กินรองพื้น แต่รองพื้นตกเป็นร่องชัด"
    },
    {
        "product_id": "C002",
        "complaint": "ปกปิดไม่สมบูรณ์",
        "detail": "คนรูขุมขนกว้างและมีรอยสิว ปกปิดได้ระดับหนึ่ง แต่ไม่เบลอรูขุมขนเท่าที่ควร"
    },
    {
        "product_id": "C002",
        "complaint": "รองพื้นตกเป็นร่องบนหน้าลอย",
        "detail": "ใช้คุชชั่นแล้วเห็นรูขุมขนชัด หน้าลอย ผิดหวังกับผลลัพธ์"
    },
    {
        "product_id": "C002",
        "complaint": "สีหลุดระหว่างวัน",
        "detail": "สีคุชชั่นไม่ค่อยดรอป แต่หลุดเป็นคราบหนักบริเวณใต้ตา ระหว่างวัน"
    },
    {
        "product_id": "C002",
        "complaint": "ราคาสูงแต่ประสิทธิภาพต่ำ",
        "detail": "รู้สึกว่าราคาสูงเกินไป เมื่อเทียบกับความติดทนและการปกปิด ควรพัฒนาสูตรก่อนขาย"
    },
    {
        "product_id": "C002",
        "complaint": "เนื้อคุชชั่นไม่ติดผิวบางส่วน",
        "detail": "บางส่วนบนหน้าคุชชั่นไม่ติดผิว ทำให้บางจุดเห็นไม่เรียบ"
    },
    {
        "product_id": "C002",
        "complaint": "เนื้อแห้งไวเกินไป",
        "detail": "คุชชั่นค่อนข้างแห้งไว ทำให้หน้าไม่เรียบและเกิดคราบได้ง่าย"
    },
    {
        "product_id": "C002",
        "complaint": "ผิดหวังกับคุณภาพเมื่อเทียบราคาสูง",
        "detail": "แม้ชอบสีและแพ็คเกจ แต่คุชชั่นมีปัญหาคราบและไม่ติดทน ทำให้รู้สึกเสียดายเงิน"
    },
    {
        "product_id": "C002",
        "complaint": "พัฟไม่ช่วยเรื่องรองพื้น",
        "detail": "พัฟที่ให้มากับคุชชั่นไม่ช่วยให้รองพื้นติดดี"
    },
    {
        "product_id": "C002",
        "complaint": "เนื้อคุชชั่นบางเบาเกินไป",
        "detail": "บางและไม่ติดผิว ทำให้การปกปิดไม่เต็มที่"
    },
    {
        "product_id": "C002",
        "complaint": "เริ่มแต่งหน้าแล้วเกิดคราบ",
        "detail": "เริ่มแต่งหน้า 9.30-18.30 น. ใช้สกินแคร์เหมือนเดิม แต่คุชชั่นเป็นคราบ"
    },
    {
        "product_id": "C002",
        "complaint": "ไม่เหมาะกับคนผิวแห้ง",
        "detail": "ผิวค่อนข้างแห้ง ใช้คุชชั่นแล้วหน้าแห้งเกินไป ไม่เหมาะกับผิวแห้ง"
    },
    {
        "product_id": "C002",
        "complaint": "บางส่วนบนหน้าไม่เรียบ",
        "detail": "เนื้อคุชชั่นไม่เรียบบางจุดบนหน้า ทำให้ผิวดูไม่สม่ำเสมอ"
    }
]