[
    {
        "product_id": "L001",
        "complaint": "ลิปมีกลิ่นฉุน หนืด ไม่ชุ่มชื้น เวลาแห้งบนปาก",
        "detail": "ฉ่ำวาวแต่ไม่ชุ่มชื้น หนืดๆ หน่อย ไม่ค่อยสบายปาก เวลาผ่านไปก็แห้ง แต่สีติดทน"
    },
    {
        "product_id": "L001",
        "complaint": "ปัญหาเรื่องการเปลี่ยนสีไม่สะดวก",
        "detail": "สั่งซื้อแล้วอยากยกเลิกเพื่อเปลี่ยนสี แอดมินไม่ยอมรับ ส่งของให้เลย ทำให้ไม่พอใจ"
    },
    {
        "product_id": "L001",
        "complaint": "แพ้ลิปหลังใช้",
        "detail": "มีตุ่มที่ปากไปพบเภสัชบอกแพ้ลิป ใช้ลิปตัวอื่นไม่แพ้ แต่ตัวนี้แพ้"
    },
    {
        "product_id": "L001",
        "complaint": "ลิปแตกง่าย",
        "detail": "ทำลิปตกโดยไม่ได้ตั้งใจ แต่ลิปแตกง่ายมาก ทำให้เสียความรู้สึก"
    },
    {
        "product_id": "L001",
        "complaint": "บริการหลังการขายไม่ยืดหยุ่น",
        "detail": "ทักแอดมินเพื่อเคลมลิปที่แตก แต่ไม่ได้รับการช่วยเหลือ"
    },
    {
        "product_id": "L001",
        "complaint": "ลิปไหลเลอะ",
        "detail": "ลิปไหลเลอะกระเป๋าแม้จะเก็บในห้องแอร์ ทำให้ไม่สะดวกในการพกพา"
    },
    {
        "product_id": "L001",
        "complaint": "ได้รับสินค้ามีตำหนิ",
        "detail": "ลิปมีจุดแปลก ๆ เต็มไปหมด ต้องคนแล้วก็ยังไม่เรียบเนียนเหมือนเพื่อน"
    },
    {
        "product_id": "L001",
        "complaint": "เนื้อลิปเหนียวเกินไป",
        "detail": "เท็กซ์เจอร์เหนียวมาก ทาแล้วไม่สวยตามที่คิด ติดทนน้อย"
    },
    {
        "product_id": "L001",
        "complaint": "สีลิปไม่ตรงตามความคาดหวัง",
        "detail": "สีแอปเปิ้ลแดงติดส้ม ไม่ชอบ ต้องการสีออกม่วง"
    },
    {
        "product_id": "L001",
        "complaint": "สีซึมออกง่าย",
        "detail": "ลิปซึมออกมามาก เวลาเปิดใช้งาน มีลิปทะลักตรงขอบ ทำให้ไม่พอใจ"
    },
    {
        "product_id": "L001",
        "complaint": "เนื้อลิปไม่เบลนด์สีได้ตามต้องการ",
        "detail": "อยากให้ลิปเบลนด์ออกสีเทา ไม่ม่วง เพื่อให้เบลนด์สีอื่นได้ดี"
    },
    {
        "product_id": "L001",
        "complaint": "ได้สินค้าหลุด QC",
        "detail": "ลิปมีรอยหมึก สีผิดปกติ ลองเช็ดก็ไม่ออก และทิ้งไว้ไม่ทิ้งสเตน ทำให้ผิดหวัง"
    },
    {
        "product_id": "L001",
        "complaint": "ต้องเติมลิประหว่างวัน",
        "detail": "เป็นลิปกลอสต้องเติมระหว่างวัน เนื้อซึม ทำให้ไม่ติดทน"
    },
    {
        "product_id": "L001",
        "complaint": "บางคนสีปากคล้ำต้องทาซ้ำหลายรอบ",
        "detail": "สีสวยแต่ต้องทาซ้ำหลายรอบสำหรับคนปากคล้ำ ทำให้เหนียว"
    },
    {
        "product_id": "L001",
        "complaint": "ราคาสูงแต่คุณภาพไม่สมราคา",
        "detail": "ราคาลิปสูง แต่คุณภาพ แพ็คเกจ และความพอใจโดยรวมไม่คุ้มค่า"
    }
]