[
    {
        "product_id": "L001",
        "complaint": "ลิปมีกลิ่นฉุน หนืด ไม่ชุ่มชื้น เวลาแห้งบนปาก",
        "detail": "ฉ่ำวาวแต่ไม่ชุ่มชื้น หนืดๆ หน่อย ไม่ค่อยสบายปาก เวลาผ่านไปก็แห้ง แต่สีติดทน"
    },
    {
        "product_id": "L001",
        "complaint": "ปัญหาเรื่องการเปลี่ยนสีไม่สะดวก",
        "detail": "สั่งซื้อแล้วอยากยกเลิกเพื่อเปลี่ยนสี แอดมินไม่ยอมรับ ส่งของให้เลย ทำให้ไม่พอใจ"
    },
    {
        "product_id": "L001",
        "complaint": "แพ้ลิปหลังใช้",
        "detail": "มีตุ่มที่ปากไปพบเภสัชบอกแพ้ลิป ใช้ลิปตัวอื่นไม่แพ้ แต่ตัวนี้แพ้"
    },
    {
        "product_id": "L001",
        "complaint": "ลิปแตกง่าย",
        "detail": "ทำลิปตกโดยไม่ได้ตั้งใจ แต่ลิปแตกง่ายมาก ทำให้เสียความรู้สึก"
    },
    {
        "product_id": "L001",
        "complaint": "บริการหลังการขายไม่ยืดหยุ่น",
        "detail": "ทักแอดมินเพื่อเคลมลิปที่แตก แต่ไม่ได้รับการช่วยเหลือ"
    },
    {
        "product_id": "L001",
        "complaint": "ลิปไหลเลอะ",
        "detail": "ลิปไหลเลอะกระเป๋าแม้จะเก็บในห้องแอร์ ทำให้ไม่สะดวกในการพกพา"
    },
    {
        "product_id": "L001",
        "complaint": "ได้รับสินค้ามีตำหนิ",
        "detail": "ลิปมีจุดแปลก ๆ เต็มไปหมด ต้องคนแล้วก็ยังไม่เรียบเนียนเหมือนเพื่อน"
    },
    {
        "product_id": "L001",
        "complaint": "เนื้อลิปเหนียวเกินไป",
        "detail": "เท็กซ์เจอร์เหนียวมาก ทาแล้วไม่สวยตามที่คิด ติดทนน้อย"
    },
    {
        "product_id": "L001",
        "complaint": "สีลิปไม่ตรงตามความคาดหวัง",
        "detail": "สีแอปเปิ้ลแดงติดส้ม ไม่ชอบ ต้องการสีออกม่วง"
    },
    {
        "product_id": "L001",
        "complaint": "สีซึมออกง่าย",
        "detail": "ลิปซึมออกมามาก เวลาเปิดใช้งาน มีลิปทะลักตรงขอบ ทำให้ไม่พอใจ"
    },
    {
        "product_id": "L001",
        "complaint": "เนื้อลิปไม่เบลนด์สีได้ตามต้องการ",
        "detail": "อยากให้ลิปเบลนด์ออกสีเทา ไม่ม่วง เพื่อให้เบลนด์สีอื่นได้ดี"
    },
    {
        "product_id": "L001",
        "complaint": "ได้สินค้าหลุด QC",
        "detail": "ลิปมีรอยหมึก สีผิดปกติ ลองเช็ดก็ไม่ออก และทิ้งไว้ไม่ทิ้งสเตน ทำให้ผิดหวัง"
    },
    {
        "product_id": "L001",
        "complaint": "ต้องเติมลิประหว่างวัน",
        "detail": "เป็นลิปกลอสต้องเติมระหว่างวัน เนื้อซึม ทำให้ไม่ติดทน"
    },
    {
        "product_id": "L001",
        "complaint": "บางคนสีปากคล้ำต้องทาซ้ำหลายรอบ",
        "detail": "สีสวยแต่ต้องทาซ้ำหลายรอบสำหรับคนปากคล้ำ ทำให้เหนียว"
    },
    {
        "product_id": "L001",
        "complaint": "ราคาสูงแต่คุณภาพไม่สมราคา",
        "detail": "ราคาลิปสูง แต่คุณภาพ แพ็คเกจ และความพอใจโดยรวมไม่คุ้มค่า"
    },

    {
        "product_id": "M001",
        "complaint": "สีลอกเมื่อถูกมือหรือสัมผัส",
        "detail": "มาสคาร่าคิ้วปกปิดดี แต่ถ้าเอามือไปถูหรือโดน สีจะถลอก ขนสีดำทะลุขึ้นมา"
    },
    {
        "product_id": "M001",
        "complaint": "ขนคิ้วเป็นก้อนเมื่อปาด",
        "detail": "ปาดไม่ดี ขนคิ้วจะเป็นก้อน งานไม่เนียน"
    },
    {
        "product_id": "M001",
        "complaint": "สูตรควรปรับปรุง",
        "detail": "สูตรปัจจุบันทำให้ขนคิ้วไม่เรียงตัวสวย ควรปรับปรุงสูตรให้ดีขึ้น"
    },
    {
        "product_id": "M001",
        "complaint": "สินค้าเสียหายหรือทำงานไม่สมบูรณ์",
        "detail": "สินค้าใช้ดี แต่ได้รับสินค้ามีปัญหา ต้องส่งกลับและรอซัพพอร์ทค่าส่งนาน"
    },
    {
        "product_id": "M001",
        "complaint": "การคืนสินค้าหรือค่าส่งล่าช้า",
        "detail": "ตามยอดค่าส่งนานเกือบอาทิตย์ยังไม่ได้รับการชำระ ซัพพอร์ททำงานช้ามาก"
    },
    {
        "product_id": "M001",
        "complaint": "แปรงใช้งานยาก",
        "detail": "แปรงใช้ยาก เป็นคราบ เลอะง่าย เนื้อมาสคาร่าคิ้วออกมาเยอะเกินไป"
    },
    {
        "product_id": "M001",
        "complaint": "แปรงหัวไม่เหมาะสม",
        "detail": "ถ้าใช้หัวแปรงแบบอื่นน่าจะดีกว่านี้ แปรงหัวปัจจุบันใช้งานยาก"
    },
    {
        "product_id": "M001",
        "complaint": "ปัดยาก",
        "detail": "ปัดเท่าไหร่ก็ไม่ได้ผล ปัดยากและไม่เรียบเนียน"
    },
    {
        "product_id": "M001",
        "complaint": "ติดเป็นก้อน",
        "detail": "ใช้ปัดขนคิ้วแล้วติดเป็นก้อน ปัดแล้วไม่เรียบเหมือนแบรนด์อื่น"
    },
    {
        "product_id": "M001",
        "complaint": "แพคเกจใหญ่เกินไป",
        "detail": "ขนาดแพคเกจใหญ่ ทำให้พกพาไม่สะดวก"
    },
    {
        "product_id": "M001",
        "complaint": "สีสวยแต่คุณภาพใช้งานยาก",
        "detail": "สีมาสคาร่าคิ้วสวย แต่คุณภาพการใช้งานจริงยังไม่ดี"
    },
    {
        "product_id": "M001",
        "complaint": "เนื้อมาสคาร่าเยอะเกินไป",
        "detail": "เนื้อมาสคาร่าออกมามากเกิน ทำให้เลอะง่าย"
    },
    {
        "product_id": "M001",
        "complaint": "เกิดคราบง่าย",
        "detail": "เวลาใช้แปรงปัดเกิดคราบง่าย ทำให้ไม่เรียบเนียน"
    },
    {
        "product_id": "M001",
        "complaint": "ประสบการณ์ใช้งานไม่สบายมือ",
        "detail": "แปรงหัวใหญ่และใช้งานยาก ทำให้การปัดลำบาก"
    },
    {
        "product_id": "M001",
        "complaint": "ต้องระวังขณะใช้งาน",
        "detail": "ควรระวังไม่ให้มือไปโดนหรือถู จะทำให้สีลอกและงานไม่เรียบ"
    },

    {
        "product_id": "B001",
        "complaint": "มีน้ำเป็นละอองในสินค้า",
        "detail": "แปลกมาก มีน้ำเป็นละอองอยู่ แต่ใช้งานได้ ปัญหาอาจเกิดจากหลุด QC"
    },
    {
        "product_id": "B001",
        "complaint": "ฝาปิดไม่สนิท",
        "detail": "ที่ปิดอีกอันปิดสนิท อีกอันปิดไม่สนิท แถมตอนแกะออกมาก็มีฝุ่นด้วย"
    },
    {
        "product_id": "B001",
        "complaint": "ได้รับสินค้าที่มีคุณภาพไม่เต็มตามราคา",
        "detail": "ได้รับสินค้าไม่ดีเต็มเท่าคนอื่น ต้องส่งคืนและเสียเวลาเดินทาง"
    },
    {
        "product_id": "B001",
        "complaint": "ฝาหลวม/เปิดยาก",
        "detail": "ฝาหลวมเพราะไม่มีเหล็กข้างหนึ่ง เปิดทีเหมือนฝาจะหลุดตลอดเวลา"
    },
    {
        "product_id": "B001",
        "complaint": "จัดส่งช้า",
        "detail": "การจัดส่งล่าช้า และแพ็คเกจไม่แข็งแรง ตลับแตกง่าย แม้ไม่ได้พกไปไหน"
    },
    {
        "product_id": "B001",
        "complaint": "ตลับแตกง่าย",
        "detail": "ตลับเป็นรอยร้าว ตลับไม่แข็งแรง หากตกคือต้องแตก"
    },
    {
        "product_id": "B001",
        "complaint": "สีบลัชไม่ตรงตามที่คาดหวัง",
        "detail": "ซื้อสีลิ้นจี่ สีดูส้มอ่อน พอเซ็ตตัวดูหมอง สีไม่ค่อยชัด"
    },
    {
        "product_id": "B001",
        "complaint": "เนื้อบลัชมีฝุ่นหรือสิ่งแปลกปลอม",
        "detail": "เนื้อบลัชมีฝุ่นหรืออะไรเกาะอยู่ แต่สีสวย"
    },
    {
        "product_id": "B001",
        "complaint": "ได้รับสินค้าไม่ครบ",
        "detail": "ได้ของไม่ครบ ทักแชทไม่มีคนตอบ ต้องแอดไลน์ไปแจ้งให้ส่งตามมา"
    },
    {
        "product_id": "B001",
        "complaint": "ระบบโปรโมชั่นมีปัญหา",
        "detail": "ซื้อ 1 แถม 1 แต่ได้แค่ชิ้นเดียว ระบบตั้งค่าแบบนี้ตั้งแต่เปิดขาย แก้ไขไม่ได้"
    },
    {
        "product_id": "B001",
        "complaint": "กลิ่นบลัชแปลก",
        "detail": "ได้รับของเร็ว สีสวย แต่กลิ่นบลัชแปลก ไม่แน่ใจว่าปกติหรือไม่"
    },
    {
        "product_id": "B001",
        "complaint": "สีบลัชติดไม่ทน",
        "detail": "วอมลงบนมือสีเบา แต่ทาแก้มเหมือนไม่ได้ทา สีควรติดกว่านี้"
    },
    {
        "product_id": "B001",
        "complaint": "เนื้อบลัชเกลี่ยยาก",
        "detail": "เนื้อแห้ง เกลี่ยค่อนข้างยาก คาดหวังสีคูลโทน แต่จริงๆ ติดอมแดงส้ม"
    },
    {
        "product_id": "B001",
        "complaint": "แพ็คเกจ/ฝาไม่ตรวจสอบก่อนส่ง",
        "detail": "ควรเช็คสินค้าก่อนส่งให้ลูกค้า เพื่อไม่ให้เกิดปัญหาฝาหลวม/สินค้าเสียหาย"
    },
    {
        "product_id": "B001",
        "complaint": "แพ็คเกจบลัชไม่ทนต่อการพกพา",
        "detail": "แพ็คเกจตลับบลัชแตกง่าย ใช้ไม่ถึงเดือน แม้ไม่ได้พกไปไหน"
    },

    {
        "product_id": "C001",
        "complaint": "แพ็คเกจสินค้าถลอก/เสียหาย",
        "detail": "สินค้าโปร 1 แถม 1 แพ็คเกจถลอกหรือเสียหาย ทำให้เสียความรู้สึก ควรปรับปรุงการแพ็คและตรวจสอบสินค้า"
    },
    {
        "product_id": "C001",
        "complaint": "สินค้าซึมออกมาในแพ็คเกจ",
        "detail": "ผลิตภัณฑ์ซึมออกมาเยอะเกินไป ใช้งานยาก ทำให้ผู้ใช้ผิดหวัง"
    },
    {
        "product_id": "C001",
        "complaint": "คอนซีลเลอร์แตกเนื้อครีมทะลัก",
        "detail": "ตัวคอนซีลเลอร์แตกเนื้อครีมทะลักออกมามากเกินความคาดหมาย"
    },
    {
        "product_id": "C001",
        "complaint": "คอนซีลเลอร์ไม่ติดหน้า",
        "detail": "ใช้แล้วเนื้อคอนซีลเลอร์ไม่ติดหน้า ลงคุชชั่นแล้วคอนซีลเลอร์ไม่ยึดติด แปรงฟองน้ำกินเนื้อคอนซีลเลอร์หมด"
    },
    {
        "product_id": "C001",
        "complaint": "สีคอนซีลเลอร์ไม่ตรงตามคาดหวัง",
        "detail": "สีแท่งติดเหลืองกว่าแบบซองเล็กน้อย แต่ยังพอใช้ได้"
    },
    {
        "product_id": "C001",
        "complaint": "เนื้อบางเบา ไม่ปกปิด",
        "detail": "เนื้อคอนซีลเลอร์บางเบา เกลี่ยง่าย แต่ไม่ช่วยปกปิดจุดด่างดำได้"
    },
    {
        "product_id": "C001",
        "complaint": "สินค้าตก QC",
        "detail": "สินค้าตก QC ใช้ได้ไม่เต็มที่ ผู้ใช้ไม่ควรคาดหวังสูง"
    },
    {
        "product_id": "C001",
        "complaint": "คอนซีลเลอร์หกเลอะ",
        "detail": "แกะสินค้าออกมาหกเลอะเทอะ เนื้อคอนซีลเลอร์หกออกมาเยอะ ทำให้เสียของ"
    },
    {
        "product_id": "C001",
        "complaint": "แพ็คเกจมีรอยร้าวมากกว่าที่แจ้ง",
        "detail": "ตอนซื้อเห็นตัวอย่างสินค้ามีรอยร้าว แต่ตัวที่ได้ร้าวมากกว่าและร้าวแบบแยกออก ทำให้เนื้อคอนซีลเลอร์ไหลออกข้างรอยแตก"
    },
    {
        "product_id": "C001",
        "complaint": "แบรนด์ไม่แก้ไขปัญหา",
        "detail": "แจ้งปัญหาเรื่องรอยร้าวแต่แบรนด์ไม่ทำอะไร ทำให้ผู้ใช้ผิดหวัง"
    },
    {
        "product_id": "C001",
        "complaint": "ปกปิดได้น้อยมาก",
        "detail": "คอนซีลเลอร์แทบไม่ปกปิดจุดด่างดำ สีหายไปเกือบหมด แม้เกลี่ยให้น้อยที่สุด"
    },
    {
        "product_id": "C001",
        "complaint": "เนื้อคอนซีลเลอร์ลงไม่สม่ำเสมอ",
        "detail": "ลงคุชชั่นแล้วคอนซีลเลอร์ไม่ติด ทำให้เนื้อไม่เรียบและไม่สม่ำเสมอบนหน้า"
    },
    {
        "product_id": "C001",
        "complaint": "โปร 1 แถม 1 ใช้ไม่ได้จริง",
        "detail": "แม้จะเป็นโปร 1 แถม 1 แต่สินค้าใช้จริงไม่ได้ตามที่คาดหวัง"
    },
    {
        "product_id": "C001",
        "complaint": "สินค้าบางชิ้นสีไม่ตรงตามโทนผิว",
        "detail": "สีแท่งบางชิ้นติดเหลืองกว่าที่คาดเล็กน้อย อาจไม่เข้ากับโทนผิวทุกคน"
    },
    {
        "product_id": "C001",
        "complaint": "การตรวจสอบคุณภาพไม่เพียงพอ",
        "detail": "สินค้าหลุด QC, แพ็คเกจร้าว, เนื้อครีมทะลัก อาจเกิดจากการตรวจสอบคุณภาพก่อนส่งไม่เพียงพอ"
    },
    
    {
        "product_id": "C002",
        "complaint": "คุชชั่นเป็นคราบง่าย",
        "detail": "คุชชั่นบางเบา แต่ทาแล้วเป็นคราบเร็ว ประมาณ 3 ชั่วโมงหลังทาเริ่มเป็นคราบ"
    },
    {
        "product_id": "C002",
        "complaint": "หน้าแห้งเกินไป",
        "detail": "เนื้อคุชชั่นแบบ semi-matte แต่ทำให้หน้าแห้งมาก เกินความคาดหวัง แม้ไม่ได้ใช้ครีมหนักหรือกันแดด"
    },
    {
        "product_id": "C002",
        "complaint": "เนื้อคุชชั่นเลอะตอนแกะ",
        "detail": "ตอนแกะคุชชั่นเนื้อเลอะเล็กน้อย และพัฟไม่กินรองพื้น แต่รองพื้นตกเป็นร่องชัด"
    },
    {
        "product_id": "C002",
        "complaint": "ปกปิดไม่สมบูรณ์",
        "detail": "คนรูขุมขนกว้างและมีรอยสิว ปกปิดได้ระดับหนึ่ง แต่ไม่เบลอรูขุมขนเท่าที่ควร"
    },
    {
        "product_id": "C002",
        "complaint": "รองพื้นตกเป็นร่องบนหน้าลอย",
        "detail": "ใช้คุชชั่นแล้วเห็นรูขุมขนชัด หน้าลอย ผิดหวังกับผลลัพธ์"
    },
    {
        "product_id": "C002",
        "complaint": "สีหลุดระหว่างวัน",
        "detail": "สีคุชชั่นไม่ค่อยดรอป แต่หลุดเป็นคราบหนักบริเวณใต้ตา ระหว่างวัน"
    },
    {
        "product_id": "C002",
        "complaint": "ราคาสูงแต่ประสิทธิภาพต่ำ",
        "detail": "รู้สึกว่าราคาสูงเกินไป เมื่อเทียบกับความติดทนและการปกปิด ควรพัฒนาสูตรก่อนขาย"
    },
    {
        "product_id": "C002",
        "complaint": "เนื้อคุชชั่นไม่ติดผิวบางส่วน",
        "detail": "บางส่วนบนหน้าคุชชั่นไม่ติดผิว ทำให้บางจุดเห็นไม่เรียบ"
    },
    {
        "product_id": "C002",
        "complaint": "เนื้อแห้งไวเกินไป",
        "detail": "คุชชั่นค่อนข้างแห้งไว ทำให้หน้าไม่เรียบและเกิดคราบได้ง่าย"
    },
    {
        "product_id": "C002",
        "complaint": "ผิดหวังกับคุณภาพเมื่อเทียบราคาสูง",
        "detail": "แม้ชอบสีและแพ็คเกจ แต่คุชชั่นมีปัญหาคราบและไม่ติดทน ทำให้รู้สึกเสียดายเงิน"
    },
    {
        "product_id": "C002",
        "complaint": "พัฟไม่ช่วยเรื่องรองพื้น",
        "detail": "พัฟที่ให้มากับคุชชั่นไม่ช่วยให้รองพื้นติดดี"
    },
    {
        "product_id": "C002",
        "complaint": "เนื้อคุชชั่นบางเบาเกินไป",
        "detail": "บางและไม่ติดผิว ทำให้การปกปิดไม่เต็มที่"
    },
    {
        "product_id": "C002",
        "complaint": "เริ่มแต่งหน้าแล้วเกิดคราบ",
        "detail": "เริ่มแต่งหน้า 9.30-18.30 น. ใช้สกินแคร์เหมือนเดิม แต่คุชชั่นเป็นคราบ"
    },
    {
        "product_id": "C002",
        "complaint": "ไม่เหมาะกับคนผิวแห้ง",
        "detail": "ผิวค่อนข้างแห้ง ใช้คุชชั่นแล้วหน้าแห้งเกินไป ไม่เหมาะกับผิวแห้ง"
    },
    {
        "product_id": "C002",
        "complaint": "บางส่วนบนหน้าไม่เรียบ",
        "detail": "เนื้อคุชชั่นไม่เรียบบางจุดบนหน้า ทำให้ผิวดูไม่สม่ำเสมอ"
    }
]